app/controllers/attendances_controller.rb

    def index
        @attendances = Attendance.all
        @events = Event.all
---
SELECT "events".* FROM "events"

    def show
        @attendance = Attendance.find(params[:id])
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]