app/controllers/charges_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("created_at", "updated_at", "event_id", "attendant_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-02-13 18:25:45.769072"], ["updated_at", "2019-02-13 18:25:45.769072"], ["event_id", 2], ["attendant_id", 3]]
---
    def create
        @event = Event.find(params[:event_id])
        event_id = @event.id
        @user = current_user
        attendant_id = @user.id
      # Amount in cents
      @amount = @event.price

      customer = Stripe::Customer.create(
        :email => params[:stripeEmail],
        :source  => params[:stripeToken]
      )

      charge = Stripe::Charge.create(
        :customer    => customer.id,
        :amount      => @amount,
        :description => 'Rails Stripe customer',
        :currency    => 'usd'
      )

      @attendance = Attendance.create(attendant_id: attendant_id, event_id: event_id)