app/controllers/users_controller.rb

      def show
        @user = User.find(params[:id])
        @events = Event.where("admin_id=?", params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE (admin_id='1')

      def user_match
      if current_user == User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]